#include "Scanner.h"

#define START 0
#define END 8

Scanner::Scanner() {

}

Token Scanner::next() {
    Token tk;
    int state = START;

    while(state != END) {
        char ch = buffer.get();
        buffer.next();

    }
    return tk;
}

//状态转移表,具体含义见文档 "扫描器自动机.pdf"
int Scanner::stateTransTable[_trans_table_raw][_trans_table_column] = {//状态转移矩阵
    { 7, 1, 7, 6, 7, 9, 8, 0, 10, 12 },
    { 8, 1, 8, 2, 3, 8, 8, 8, 8, 8 },
    { 8, 2, 8, 8, 3, 8, 8, 8, 8, 8 },
    { 8, 5, 8, 8, 8, -1, 4, -1, -1, -1 },
    { 8, 5, 8, 8, 8, -1, 8, -1, -1, -1 },
    { 8, 5, 8, 8, 8, 8, 8, 8, 8, 8 },
    { 8, 2, 8, 8, 8, -1, 8, -1, -1, -1 },
    { 7, 7, 7, 8, 7, 8, 8, 8, 8, 8 },
    { 7, 1, 7, 6, 7, 8, 8, 0, 10, 12 },
    { 8, 8, 8, 8, 8, 9, 8, 8, 8, 8 },
    { 11, 11, 11, 11, 11, 11, 11, 11, -1, 11 },
    { -1, -1, -1, -1, -1, -1, -1, -1, 14, -1 },
    { 13, 13, 13, 13, 13, 13, 13, 13, 13, 14 },
    { 13, 13, 13, 13, 13, 13, 13, 13, 13, 14 },
    { 8, 8, 8, 8, 8, 8, 8, 8, 8, 8 }
};